spec/fixtures/vcr_cassettes/phase_one_upsell_flows/purchase_workbook_and_subscription.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/customers
    body:
      encoding: US-ASCII
      string: card=tok_3Z6UiPLkPfvaYB&description=beansalad%40idealme.com
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.10.2
      Authorization:
      - Bearer sk_test_McolaUo3frJYYalxTTjg0Au1
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - "{\"bindings_version\":\"1.10.2\",\"lang\":\"ruby\",\"lang_version\":\"2.1.0
        p0 (2013-12-25)\",\"platform\":\"x86_64-darwin12.0\",\"publisher\":\"stripe\",\"uname\":\"Darwin
        charlie.local 13.1.0 Darwin Kernel Version 13.1.0: Thu Jan 16 19:40:37 PST
        2014; root:xnu-2422.90.20~2/RELEASE_X86_64 x86_64\"}"
      Content-Length:
      - '59'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 26 Feb 2014 03:23:06 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1172'
      Connection:
      - keep-alive
      Cache-Control:
      - no-cache, no-store
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Max-Age:
      - '300'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "object": "customer",
          "created": 1393384985,
          "id": "cus_3Z6UhVCqgASpXX",
          "livemode": false,
          "description": "beansalad@idealme.com",
          "email": null,
          "delinquent": false,
          "metadata": {},
          "subscriptions": {
            "object": "list",
            "count": 0,
            "url": "/v1/customers/cus_3Z6UhVCqgASpXX/subscriptions",
            "data": []
          },
          "discount": null,
          "account_balance": 0,
          "currency": null,
          "cards": {
            "object": "list",
            "count": 1,
            "url": "/v1/customers/cus_3Z6UhVCqgASpXX/cards",
            "data": [
              {
                "id": "card_3Z6USpQgeNXeHs",
                "object": "card",
                "last4": "4242",
                "type": "Visa",
                "exp_month": 1,
                "exp_year": 2020,
                "fingerprint": "0FJgJUWQopgJgoZs",
                "customer": "cus_3Z6UhVCqgASpXX",
                "country": "US",
                "name": null,
                "address_line1": null,
                "address_line2": null,
                "address_city": null,
                "address_state": null,
                "address_zip": null,
                "address_country": null,
                "cvc_check": "pass",
                "address_line1_check": null,
                "address_zip_check": null
              }
            ]
          },
          "default_card": "card_3Z6USpQgeNXeHs"
        }
    http_version: 
  recorded_at: Wed, 26 Feb 2014 03:23:08 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/charges
    body:
      encoding: US-ASCII
      string: amount=700&currency=usd&customer=cus_3Z6UhVCqgASpXX
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.10.2
      Authorization:
      - Bearer sk_test_McolaUo3frJYYalxTTjg0Au1
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - "{\"bindings_version\":\"1.10.2\",\"lang\":\"ruby\",\"lang_version\":\"2.1.0
        p0 (2013-12-25)\",\"platform\":\"x86_64-darwin12.0\",\"publisher\":\"stripe\",\"uname\":\"Darwin
        charlie.local 13.1.0 Darwin Kernel Version 13.1.0: Thu Jan 16 19:40:37 PST
        2014; root:xnu-2422.90.20~2/RELEASE_X86_64 x86_64\"}"
      Content-Length:
      - '51'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 26 Feb 2014 03:23:06 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '969'
      Connection:
      - keep-alive
      Cache-Control:
      - no-cache, no-store
      Access-Control-Max-Age:
      - '300'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Credentials:
      - 'true'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "ch_3Z6UOoYt9U4m8T",
          "object": "charge",
          "created": 1393384986,
          "livemode": false,
          "paid": true,
          "amount": 700,
          "currency": "usd",
          "refunded": false,
          "card": {
            "id": "card_3Z6USpQgeNXeHs",
            "object": "card",
            "last4": "4242",
            "type": "Visa",
            "exp_month": 1,
            "exp_year": 2020,
            "fingerprint": "0FJgJUWQopgJgoZs",
            "customer": "cus_3Z6UhVCqgASpXX",
            "country": "US",
            "name": null,
            "address_line1": null,
            "address_line2": null,
            "address_city": null,
            "address_state": null,
            "address_zip": null,
            "address_country": null,
            "cvc_check": "pass",
            "address_line1_check": null,
            "address_zip_check": null
          },
          "captured": true,
          "refunds": [],
          "balance_transaction": "txn_3Z6UbcnBpOBuLl",
          "failure_message": null,
          "failure_code": null,
          "amount_refunded": 0,
          "customer": "cus_3Z6UhVCqgASpXX",
          "invoice": null,
          "description": null,
          "dispute": null,
          "metadata": {}
        }
    http_version: 
  recorded_at: Wed, 26 Feb 2014 03:23:09 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/customers/cus_3Z6UhVCqgASpXX
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.10.2
      Authorization:
      - Bearer sk_test_McolaUo3frJYYalxTTjg0Au1
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - "{\"bindings_version\":\"1.10.2\",\"lang\":\"ruby\",\"lang_version\":\"2.1.0
        p0 (2013-12-25)\",\"platform\":\"x86_64-darwin12.0\",\"publisher\":\"stripe\",\"uname\":\"Darwin
        charlie.local 13.1.0 Darwin Kernel Version 13.1.0: Thu Jan 16 19:40:37 PST
        2014; root:xnu-2422.90.20~2/RELEASE_X86_64 x86_64\"}"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 26 Feb 2014 03:23:10 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1172'
      Connection:
      - keep-alive
      Access-Control-Max-Age:
      - '300'
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Cache-Control:
      - no-cache, no-store
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "object": "customer",
          "created": 1393384985,
          "id": "cus_3Z6UhVCqgASpXX",
          "livemode": false,
          "description": "beansalad@idealme.com",
          "email": null,
          "delinquent": false,
          "metadata": {},
          "subscriptions": {
            "object": "list",
            "count": 0,
            "url": "/v1/customers/cus_3Z6UhVCqgASpXX/subscriptions",
            "data": []
          },
          "discount": null,
          "account_balance": 0,
          "currency": null,
          "cards": {
            "object": "list",
            "count": 1,
            "url": "/v1/customers/cus_3Z6UhVCqgASpXX/cards",
            "data": [
              {
                "id": "card_3Z6USpQgeNXeHs",
                "object": "card",
                "last4": "4242",
                "type": "Visa",
                "exp_month": 1,
                "exp_year": 2020,
                "fingerprint": "0FJgJUWQopgJgoZs",
                "customer": "cus_3Z6UhVCqgASpXX",
                "country": "US",
                "name": null,
                "address_line1": null,
                "address_line2": null,
                "address_city": null,
                "address_state": null,
                "address_zip": null,
                "address_country": null,
                "cvc_check": "pass",
                "address_line1_check": null,
                "address_zip_check": null
              }
            ]
          },
          "default_card": "card_3Z6USpQgeNXeHs"
        }
    http_version: 
  recorded_at: Wed, 26 Feb 2014 03:23:12 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/customers/cus_3Z6UhVCqgASpXX/subscriptions
    body:
      encoding: US-ASCII
      string: plan=1
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.10.2
      Authorization:
      - Bearer sk_test_McolaUo3frJYYalxTTjg0Au1
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - "{\"bindings_version\":\"1.10.2\",\"lang\":\"ruby\",\"lang_version\":\"2.1.0
        p0 (2013-12-25)\",\"platform\":\"x86_64-darwin12.0\",\"publisher\":\"stripe\",\"uname\":\"Darwin
        charlie.local 13.1.0 Darwin Kernel Version 13.1.0: Thu Jan 16 19:40:37 PST
        2014; root:xnu-2422.90.20~2/RELEASE_X86_64 x86_64\"}"
      Content-Length:
      - '6'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 26 Feb 2014 03:23:11 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '696'
      Connection:
      - keep-alive
      Cache-Control:
      - no-cache, no-store
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Max-Age:
      - '300'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "sub_3Z6U0XHHboBtGo",
          "plan": {
            "interval": "month",
            "name": "Ideal Me Insider Circle 1",
            "created": 1393018297,
            "amount": 1995,
            "currency": "usd",
            "id": "1",
            "object": "plan",
            "livemode": false,
            "interval_count": 1,
            "trial_period_days": null,
            "metadata": {}
          },
          "object": "subscription",
          "start": 1393384990,
          "status": "active",
          "customer": "cus_3Z6UhVCqgASpXX",
          "cancel_at_period_end": false,
          "current_period_start": 1393384990,
          "current_period_end": 1395804190,
          "ended_at": null,
          "trial_start": null,
          "trial_end": null,
          "canceled_at": null,
          "quantity": 1,
          "application_fee_percent": null,
          "discount": null
        }
    http_version: 
  recorded_at: Wed, 26 Feb 2014 03:23:13 GMT
recorded_with: VCR 2.8.0
